<a href="https://colab.research.google.com/github/SirTee12/Hamoye_tag_along_project1/blob/main/Hamoye_Introduction_to_python_for_machine_learning_tag_along_project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Tag along project
### Hamoye ID : 15e3f34c3c81f000

In [ ]:
import numpy as np
import pandas as pd

## Question 1

## Question 2

In [ ]:

lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]

col = ['Age', 'Nationality','Overall']
demograph = pd.DataFrame(lst, columns = col, index = [1,2,3])
demograph1 = pd.DataFrame(lst, columns = col, index = [i for i in range(1,4)])

print(demograph)
print(demograph1)

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92
   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

## Question 3

In [ ]:
my_tuppy = (1,2,5,8)

my_tuppy[2] = 6

TypeError: 'tuple' object does not support item assignment

## Question 4

In [ ]:
food_bal = pd.read_csv('FoodBalanceSheets_E_Africa_NOFLAG.csv', encoding= 'Latin-1')
food_bal.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

In [ ]:
food_bal.Area.nunique()

49

## Question 6

In [ ]:
area_sum = food_bal.groupby('Area')['Y2017'].sum().reset_index()
area_sum = area_sum.sort_values('Y2017', ascending = False)
area_sum.head()

            Area       Y2017
34       Nigeria  1483268.23
13         Egypt   866379.92
40  South Africa   517590.54
15      Ethiopia   448683.76
30       Morocco   388495.36

## Question 7

In [ ]:
print('number of missing data is {}'.format(food_bal.Y2014.isna().sum()))
print('percentage of missing data is {}'.format(food_bal.Y2014.isna().sum()/food_bal.shape[0] * 100.0))

number of missing data is 1589
percentage of missing data is 2.6073544131401474

## Question 9

In [ ]:
stock_var = food_bal.groupby('Element')[['Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018']].sum().reset_index()
stock_var = stock_var.sort_values(['Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018'], ascending = False)
stock_var

,Element,Y2014,Y2015,Y2016,Y2017,Y2018
0,Domestic supply quantity,1996716.35,2021493.55,2044842.70,2088198.10,2161192.10
11,Production,1931287.75,1947019.39,1943537.15,2030056.89,2075072.89
4,Food,1212332.49,1232361.10,1247022.17,1258888.28,1303841.28
16,Total Population - Both sexes,1031585.00,1058081.00,1085107.00,1112641.00,1140605.00
5,Food supply (kcal/capita/day),454257.00,453383.00,451810.00,454681.00,455261.00
10,Processing,282923.00,287929.00,280631.00,292836.00,308429.00
7,Import Quantity,274144.48,267018.46,286582.78,294559.09,287997.09
3,Feed,216927.89,225050.22,228958.65,223705.68,233489.68
8,Losses,153223.00,155439.00,157787.00,160614.00,163902.00
1,Export Quantity,150020.64,157614.47,151920.46,182338.80,181594.80
9,Other uses (non-food),78718.13,66254.41,69563.68,91645.97,91300.97
15,Stock Variation,58749.83,34910.99,33140.12,54316.91,20577.91
6,Food supply quantity (kg/capita/yr),49650.63,49345.13,48985.28,48690.04,49056.85
13,Residuals,30149.00,30045.00,37224.00,35500.00,34864.00
14,Seed,21922.92,23976.82,23389.20,24870.14,25263.14
12,Protein supply quantity (g/capita/day),11836.46,11833.95,11779.69,11842.45,11833.56
2,Fat supply quantity (g/capita/day),10225.56,10235.74,10102.77,10253.84,10258.69
17,Tourist consumption,416.00,349.00,89.00,91.00,90.00

## Question 10

In [ ]:
area_sum = food_bal.groupby('Element')['Y2015'].sum().reset_index()
area_sum[area_sum['Element'] == 'Protein supply quantity (g/capita/day)']

                                   Element     Y2015
12  Protein supply quantity (g/capita/day)  11833.95

## Question 11

In [ ]:
area_sum = food_bal.groupby('Area')['Y2017'].sum().reset_index()
area_sum = area_sum.sort_values('Y2017', ascending = False)
area_sum.tail(7)

                     Area     Y2017
21          Guinea-Bissau  19102.77
5              Cabo Verde  14650.74
36  Sao Tome and Principe  12662.63
38             Seychelles    442.34
9                 Comoros     59.84
42         Sudan (former)      0.00
16           Ethiopia PDR      0.00

## Question 12

In [ ]:

array  = np.array([[94, 89, 63],

             [93, 92, 48],

             [92, 94, 56]])
array[:2, 1:]

array([[89, 63],
       [92, 48]])

## Question 14

In [ ]:
process_sum = food_bal.groupby('Element')['Y2017'].sum().reset_index()
process_sum[process_sum['Element']=='Processing']

       Element     Y2017
10  Processing  292836.0

## Question 15

In [ ]:
df.shape

## Question 16

In [ ]:
print('mean is {}'.format(np.round(food_bal.Y2017.mean(), 2)))
print('std is {}'.format(np.round(food_bal.Y2017.std(), 2)))

mean is 140.92
std is 1671.86

## Question 17

In [ ]:
corr_year = []
for col in food_bal.columns[7:]:
    corr=  food_bal['Element Code'].corr(food_bal[col])
    corr_year.append(corr)
    print(col + ': ' + str(corr))
print('minimum correlation is {} for '.format(np.min(corr_year)))

Y2014: 0.024456819495222167
Y2015: 0.02388919930164121
Y2016: 0.023443997584962413
Y2017: 0.024254007760045458
Y2018: 0.024278571953519328
minimum correlation is 0.023443997584962413 for

## Qustion 18

In [ ]:
S = [['him', 'sell'], [90, 28, 43]]

S[0][1][1]

'e'

## Question 19

In [ ]:
sum_prod = food_bal.groupby('Item')['Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018'].sum().reset_index()
sum_prod[sum_prod['Item']=='Wine']

C:\Users\pc\AppData\Local\Temp\ipykernel_4604\1397353154.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  sum_prod = food_bal.groupby('Item')['Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018'].sum().reset_index()

     Item    Y2014    Y2015    Y2016    Y2017    Y2018
117  Wine  4497.36  4251.81  3872.09  4178.02  4039.32

## Question 20

In [ ]:
y = [(2, 4), (7, 8), (1, 5, 9)]
x = y[1][1]
x

8